[
  "templater-obsidian",
  "quickadd",
  "dataview",
  "periodic-notes",
  "calendar",
  "obsidian-kanban",
  "obsidian-tasks-plugin",
  "obsidian-advanced-uri",
  "table-editor-obsidian",
  "obsidian-excalidraw-plugin",
  "obsidian-markdown-formatting-assistant-plugin"
]