[
  "obsidian-linter",
  "better-word-count",
  "highlightr-plugin",
  "obsidian-auto-link-title",
  "colored-text",
  "dataview",
  "drawio-obsidian",
  "mermaid-tools",
  "quickadd",
  "templater-obsidian",
  "make-md"
]